Autodesk.Revit.DB.Blob.IsWithinBufferCapacity(System.Int32)
Returns true if Blob's capacity is at least the specified number of bytes.
nBytes:
The number of bytes to check.
Returns:
True if the binary data is within the specified size limit.

Autodesk.Revit.DB.Blob.WriteBytesToBlob(System.IntPtr,System.Int32)
Write binary data to the Blob.
buffer:
Pointer to the first byte that will be written to the blob.
nBytes:
The number of bytes to write to the Blob.
Returns:
True if the binary data was successfully written to the Blob.

Autodesk.Revit.DB.Blob.ReadBytesFromBlob(System.IntPtr@,System.Int32)
Copy binary data from blob to an allocated buffer.
buffer:
The target buffer to receive the binary data.
nBytes:
The number of bytes to read from the Blob.
Returns:
True if the binary data was successfully copied from the Blob to the buffer.

Autodesk.Revit.DB.Blob.GetBinaryData
Returns a pointer to the object's data buffer.
Returns:
A pointer to the data buffer.

Autodesk.Revit.DB.Blob.GetBinaryDataSize
Returns the size of the object's data buffer.
Returns:
The size of the data buffer, in bytes.

Autodesk.Revit.DB.Blob.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Blob.Id
The ID of the Blob.

Autodesk.Revit.DB.Blob.#ctor(System.String,System.Int32)
Creates an empty Blob of the specified size
id:
The ID of the binary object.
size:
The size of the blob, in bytes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Blob
This class represents an arbitrary binary object.